import Container from "@/components/Container";
import Layout from "@/components/Layout";
import styled from "styled-components";

const AboutUsInner = styled.div`
  padding-bottom: 20px;
`;

const AboutUs: React.FC<{}> = () => {
  return (
    <Layout title={"Matko Vuković | O školi"} content={"description"}>
      <Container>
        <AboutUsInner>
          <h1>O školi</h1>
          <p>
            Образовање деце је традиција и обавеза. Због тога су наши преци још
            давне 1857. године у Суботици изградили и прву основну школу која
            данас носи име "Соња Маринковић". Она се раније звала: "Основна
            школа првог кварта", ОШ "Доситеј Обрадовић", ОШ првог кварта "Пајо
            Кујунџић". Данашње име добила је 1962. год. по народном хероју Соњи
            Маринковић, рођене 3. јуна када се прославља и дан школе. Ми смо
            данас школа која је спој традиције, искуства и нових наставних
            метода рада спремних да радимо у 21. веку.
          </p>
          <br />
          <h2 style={{ color: "var(--gray-300)" }}>Radimo u tri zgrade:</h2>
          <h2>Centralna škola</h2>
          <h2>Mala škola u Gatu</h2>
          <h2>Mala škola u Malom bajmoku</h2>

          <h2 style={{ color: "var(--gray-300)" }}>Ђаци су наша школа</h2>
          <p>
            Свим запосленима је драго што све ово имају, али - нашу школу не
            чине просторије и објекти. НАША ШКОЛА СУ НАШИ САДАШЊИ ЂАЦИ , И МНОГЕ
            ГЕНЕРАЦИЈЕ, И ТАКО ПРЕКО 150 ГОДИНА. Они постижу запажене резултате
            у образовном смислу што доказују бројне дипломе на такмичењима од
            општинских до државних. Школске ходнике красе многи пехари и медаље.
            Наши ђаци годинама уназад полажу пријемне испите за средњу школу са
            највећим бројем бодова у општини и региону и уписују даље школе које
            су и желили. Зато и није никако чудо што се овде школују деца и са
            других територија града јер се добар глас надалеко чује.
          </p>
        </AboutUsInner>
      </Container>
    </Layout>
  );
};

export default AboutUs;
